## 1.对于Serise理解哦

In [1]:
import pandas as pd
import numpy as np

### 1.1他是一个带有索引的列表

In [2]:
obj = pd.Series([5,6,8,0])
print(obj)

0    5
1    6
2    8
3    0
dtype: int64

In [3]:
print(obj[2])

8

**这里的索引可以通过改变index来改变**

In [4]:
z = pd.Series([4,5,7,89],index=['d','r','t','o'])
print(z)

d     4
r     5
t     7
o    89
dtype: int64

**我们对于Serise的数字运算，都是针元素的，不改变索引**

In [5]:
print(z*2)

d      8
r     10
t     14
o    178
dtype: int64

**对于索引的操作有：判断这个索引是否在这个Series里面**

In [6]:
print('d' in z)

True

**我们知道Series是一个有索引的字典，那么如果我们导入的是字典，那么我们既可以输入value，也可以同时决定key**

In [7]:
state = {'a':1,'b':2,'c':3,'d':4}
z = pd.Series(state)
print(z)

a    1
b    2
c    3
d    4
dtype: int64

**我们改变索引，添加没有value的key，那么这个key所对应的的是nan。同理如果我们删除一个有value的所索引，这个索引和value都会被删除**

In [8]:
z = pd.Series(state,index=['a','c','d','e'])  #删除了d，添加了e，更改了顺序
print(z)

a    1.0
c    3.0
d    4.0
e    NaN
dtype: float64

**使用pandas的isnull和notnull函数检测确实数据**

In [9]:
pd.isnull(z)

a    False
c    False
d    False
e     True
dtype: bool

In [10]:
pd.notnull(z)

a     True
c     True
d     True
e    False
dtype: bool

**Series可以看做表格，我们可以通过name和index.name，来为表格取名字和增加表头**

In [11]:
z.name = '数字'
z.index.name = '字母'
print(z)

字母
a    1.0
c    3.0
d    4.0
e    NaN
Name: 数字, dtype: float64

## 2 DataFrame的理解

**DataFrame是可以建立一个表格，
这个表格载入的文件是字典，
其中表格的表头是通过字典的key，
表格的数据是通过字典的value，
其中表格的value是数组形式**

In [12]:
data = {'名字':['and','che','wang','jack'],
        '年龄':[21,34,22,45],
        '国家':['美国','中国','日本','新加坡']}

In [13]:
z = pd.DataFrame(data)
z #juypter的装饰输出

     名字  年龄   国家
0   and  21   美国
1   che  34   中国
2  wang  22   日本
3  jack  45  新加坡

**columns和index分别代表了每一列和每一行的表头，可以被改变**

In [14]:
z = pd.DataFrame(data,columns=['名字','国家','体重','年龄'],index=['one','two','three','four'])
z

         名字   国家   体重  年龄
one     and   美国  NaN  21
two     che   中国  NaN  34
three  wang   日本  NaN  22
four   jack  新加坡  NaN  45

**通过行和列的调用可以定位那个元素**

In [15]:
z.名字.one

'and'

**对于nan的数据，我们可以通过赋值的方式搞定**

In [16]:
z['体重']=16.25

In [17]:
z

         名字   国家     体重  年龄
one     and   美国  16.25  21
two     che   中国  16.25  34
three  wang   日本  16.25  22
four   jack  新加坡  16.25  45

In [18]:
'''
对于数据的填充，大致有两种方法:1.对于列或行的数据统一填充 2.分散的数据通过列或行的数据对应填充（可以通过Serise来完成）
'''

'\n对于数据的填充，大致有两种方法:1.对于列或行的数据统一填充 2.分散的数据通过列或行的数据对应填充（可以通过Serise来完成）\n'

In [19]:
#方法一
z['体重']=np.ceil(np.random.uniform(0,10,4))
z

         名字   国家   体重  年龄
one     and   美国  8.0  21
two     che   中国  7.0  34
three  wang   日本  6.0  22
four   jack  新加坡  3.0  45

In [20]:
a = pd.Series([11,15,39],index=['one','three','four'])
z['体重']=a
z

         名字   国家    体重  年龄
one     and   美国  11.0  21
two     che   中国   NaN  34
three  wang   日本  15.0  22
four   jack  新加坡  39.0  45

**还有一种数据形式是多个字典的嵌套（一般是两个字典的嵌套）,pandas的解析是：最外层的key是列头，里面的key是行头**

In [21]:
data = {'美国':{'足球队员':'andi','羽毛球队员':'uuiioh','排球':'uujiode1qq'},
        '日本':{'足球队员':'uehk','羽毛球队员':'jgalfg','排球':'ftuk','台球':'uhahsjfh'}}

In [22]:
z = pd.DataFrame(data)
z

               美国        日本
台球            NaN  uhahsjfh
排球     uujiode1qq      ftuk
羽毛球队员      uuiioh    jgalfg
足球队员         andi      uehk

In [23]:
z.T   #通过T可以转置

          台球          排球   羽毛球队员  足球队员
美国       NaN  uujiode1qq  uuiioh  andi
日本  uhahsjfh        ftuk  jgalfg  uehk

## 3.Pands基本功能

### 3.1重新索引

**Series和Dataframe这两个类，在已经确定好的情况下，reindex这个方法，改变索引。**


**改变索引无非两个方向：一个是增加索引，一个是删除索引。如果是删除，那么这个索引对应的数据就消失了。如果是增加索引，那么就会有nan数据产生。所以在增加时，我们使用method和一些方法，尽量填充数据。**

In [24]:
'''
Series类
'''
obj = pd.Series([1,2,3,4,5],index=['a','s','d','f','g'])
obj

a    1
s    2
d    3
f    4
g    5
dtype: int64

In [25]:
obj.reindex(['a','b','g','v','b'])

a    1.0
b    NaN
g    5.0
v    NaN
b    NaN
dtype: float64

In [26]:
'''
使用method参数的‘ffill’，这个参数表明我的数据是向前填
这个必须是时间序列才可以（所谓时间序列值数字序列，有大小之分）
'''
obj2 = pd.Series(['a','b','c'],index=[0,2,4])

obj2.reindex(np.arange(6),method='ffill')

0    a
1    a
2    b
3    b
4    c
5    c
dtype: object

In [27]:
'''
Dataframe类
'''
frame = pd.DataFrame(np.ceil(np.random.uniform(1,99,(3,3))),index=['a','b','c'],columns=['!','@','#'])
frame

      !     @     #
a  53.0  87.0  99.0
b  51.0  68.0  15.0
c  92.0  81.0  40.0

In [28]:
'''
默认的reindex是行
如果是改变列的索引，使用column参数
'''
frame2 = frame.reindex(['b','c','e','a'])
frame2

      !     @     #
b  51.0  68.0  15.0
c  92.0  81.0  40.0
e   NaN   NaN   NaN
a  53.0  87.0  99.0

In [29]:
frame3 = frame.reindex(columns=['%','^','&'])
frame3

    %   ^   &
a NaN NaN NaN
b NaN NaN NaN
c NaN NaN NaN

### 3.2 丢弃指定轴上的项

**Serise和DataFram是不太一样的表格，存在删除表格某一个列或行的需求，此时我们需要用到drop()这个方法。**

**对于Series**

In [30]:
data = pd.Series(np.arange(4),index=['a','b','c','d'])
data

a    0
b    1
c    2
d    3
dtype: int32

In [31]:
data.drop('c')

a    0
b    1
d    3
dtype: int32

In [32]:
data  #可以看出这时，使用drop()没有替代成为新的函数

a    0
b    1
c    2
d    3
dtype: int32

In [33]:
data.drop(['a','c'],inplace=True) #这个是我们替代了之后，使用了inplace来永久替代了

In [34]:
"""
其中a,c用inplace替代之后，永久被替代
"""
data #这个是我们替代了之后，使用了inplace来永久替代了

b    1
d    3
dtype: int32

**对于DataFrame**

In [35]:
f = {'美国':{'足球队员':'andi','羽毛球队员':'uuiioh','排球':'uujiode1qq'},

         '日本':{'足球队员':'uehk','羽毛球队员':'jgalfg','排球':'ftuk','台球':'uhahsjfh'}}
frame = pd.DataFrame(f)
frame

               美国        日本
台球            NaN  uhahsjfh
排球     uujiode1qq      ftuk
羽毛球队员      uuiioh    jgalfg
足球队员         andi      uehk

In [36]:
frame.drop('台球')

               美国      日本
排球     uujiode1qq    ftuk
羽毛球队员      uuiioh  jgalfg
足球队员         andi    uehk

In [37]:
frame.drop(['台球','排球'])

           美国      日本
羽毛球队员  uuiioh  jgalfg
足球队员     andi    uehk

In [38]:
'''
通过传递axis可以删除了列的值
其中去axis=1,为列
'''
frame.drop('美国',axis=1)

             日本
台球     uhahsjfh
排球         ftuk
羽毛球队员    jgalfg
足球队员       uehk

### 3.3 索取、选取和过滤

**对于Series**

In [39]:
data = pd.Series(np.arange(4),index=['a','b','c','d'])
data

a    0
b    1
c    2
d    3
dtype: int32

**可以通过对于索引的选择来获取所要的数**

In [49]:
data['a']

0

**对于Series，关于key使用切片，那么这个切片的末尾是被包含的。
如果是切片的是需要，将不被包含最后一个**

In [58]:
data[1:3]  #这里的数字值的是行的序号

b    1
c    2
dtype: int32

In [60]:
data['a':'d']

a    0
b    1
c    2
d    3
dtype: int32

In [74]:

data([['a','b','c']]

SyntaxError: unexpected EOF while parsing (<ipython-input-74-08ae6f49fa07>, line 2)

**我们如果对于这个data做一个运算，那么就是对于这个data所有的数据做运算（不包括索引）**

In [67]:
print(data>0)

a    False
b     True
c     True
d     True
dtype: bool

In [68]:
data[data>2]

d    3
dtype: int32

In [71]:
data[data<=2]=100
data

a    100
b    100
c    100
d      3
dtype: int32

**对于DataFrame**

In [64]:
f = {'美国':{'足球队员':'andi','羽毛球队员':'uuiioh','排球':'uujiode1qq'},

         '日本':{'足球队员':'uehk','羽毛球队员':'jgalfg','排球':'ftuk','台球':'uhahsjfh'}}
frame = pd.DataFrame(f)
frame

               美国        日本
台球            NaN  uhahsjfh
排球     uujiode1qq      ftuk
羽毛球队员      uuiioh    jgalfg
足球队员         andi      uehk

In [65]:
frame['美国']

台球              NaN
排球       uujiode1qq
羽毛球队员        uuiioh
足球队员           andi
Name: 美国, dtype: object

In [73]:
frame[['美国','日本']]

               美国        日本
台球            NaN  uhahsjfh
排球     uujiode1qq      ftuk
羽毛球队员      uuiioh    jgalfg
足球队员         andi      uehk

In [76]:
frame[0:2]   #这个的对于行是通过序号取得，注意和drop()用法区别

            美国        日本
台球         NaN  uhahsjfh
排球  uujiode1qq      ftuk

### 3.4用loc和iloc进行选取

**loc和iloc都是DataFrame和Series下的数据选取的方法，loc是key值，iloc是所代表的的序号**

In [103]:
data = pd.DataFrame(np.ceil(np.random.uniform(1,100,(4,4))),index=['体重','年龄','考试','体育'],
                   columns=['one','two','three','four'])
data

     one   two  three  four
体重  36.0  17.0   72.0  77.0
年龄  67.0   3.0   79.0  60.0
考试  30.0  12.0   93.0  61.0
体育  41.0  19.0   90.0  71.0

In [104]:
'''
取到行的位置，再确定列的位置
'''
data.loc['体重',['one','two']]

one    36.0
two    17.0
Name: 体重, dtype: float64

In [147]:
"""
和上面对比发现，也是先去行，再确定列
"""
data.iloc[3,:3]

one      41.0
two      19.0
three    90.0
Name: 体育, dtype: float64

In [143]:
data.iloc[:,:3][data>25] #对于行列筛选完毕之后，再可以对所有的数据筛选

     one  two  three
体重  36.0  NaN   72.0
年龄  67.0  NaN   79.0
考试  30.0  NaN   93.0
体育  41.0  NaN   90.0

### 3.5 整数索引

In [125]:
ser = pd.Series(np.arange(3))   #和是不是小数没有关系

ser

0    0
1    1
2    2
dtype: int32

In [148]:
ser[-1]

KeyError: -1

In [149]:
ser2 = pd.Series(np.arange(3.),index=['a','b','c'])

In [128]:
ser2[-1]

2.0

**如何解释这个问题：我们使用的Series类的元素查找，所以它的索引方法和python内置字典和列表不一样，所以在序号为-1时无法解析，但是当设定了index时，就可以引入-1序号**

In [150]:
ser.iloc[:2]

0    0
1    1
dtype: int32

**纠正两个误区，对于iloc和loc在DataFrame和Series上面都可以使用。Series的使用索引(key),其切片包含最后一个，所以在使用loc()使，用切片是包含最后一个数据的。但是使用iloc()是不包含最后一个的）**

### 3.6算数运算和数据对齐

**总结来说就是,对于Series和DataFrame的数据，做相加的运算(注意这里相加),有相同的元素则会将其加起来；没有的元素会展示出来(只要其中有一个没有展现出来)，值变成了nan**

In [166]:
data1 = pd.Series([1,2,3,4,5,6],index=['a','b','c','d','e','f'])
data2 = pd.Series([100,200,300],index=['a','b','f'])

In [167]:
data1

a    1
b    2
c    3
d    4
e    5
f    6
dtype: int64

In [168]:
data2

a    100
b    200
f    300
dtype: int64

In [169]:
data1+data2

a    101.0
b    202.0
c      NaN
d      NaN
e      NaN
f    306.0
dtype: float64

In [170]:
data1*data2

a     100.0
b     400.0
c       NaN
d       NaN
e       NaN
f    1800.0
dtype: float64

In [160]:
frame1 = pd.DataFrame(np.ceil(np.random.uniform(1,100,(4,4))),index=['体重','年龄','考试','体育'],
                   columns=['one','two','three','four'])
frame2 = pd.DataFrame(np.ceil(np.random.uniform(1,100,(2,4))),index=['美术','体育'],
                   columns=['one','two','three','four'])

In [161]:
frame1

     one   two  three  four
体重  83.0  77.0   44.0  37.0
年龄  86.0  87.0   25.0  57.0
考试   3.0  86.0    6.0  57.0
体育  11.0  19.0   63.0  84.0

In [162]:
frame2

     one   two  three  four
美术  75.0  78.0   51.0  89.0
体育  94.0   3.0   34.0  21.0

In [163]:
frame1+frame2

      one   two  three   four
体育  105.0  22.0   97.0  105.0
体重    NaN   NaN    NaN    NaN
年龄    NaN   NaN    NaN    NaN
美术    NaN   NaN    NaN    NaN
考试    NaN   NaN    NaN    NaN

In [171]:
frame1*frame2

       one   two   three    four
体育  1034.0  57.0  2142.0  1764.0
体重     NaN   NaN     NaN     NaN
年龄     NaN   NaN     NaN     NaN
美术     NaN   NaN     NaN     NaN
考试     NaN   NaN     NaN     NaN

### 3.7在算数方法中填值

**上题中，我们将两个表格相加减，会出现很多nan，我们需要一个办法将nan消除**

add()这个方法可以通过参数fill_value=来决定，将因为索引的缺失而使得最后数字为nan的情况

In [172]:
data1

a    1
b    2
c    3
d    4
e    5
f    6
dtype: int64

In [173]:
data2

a    100
b    200
f    300
dtype: int64

In [175]:
data1.add(data2,fill_value=0) #它把之前不存在的值，默认设为0了

a    101.0
b    202.0
c      3.0
d      4.0
e      5.0
f    306.0
dtype: float64

In [176]:
frame1

     one   two  three  four
体重  83.0  77.0   44.0  37.0
年龄  86.0  87.0   25.0  57.0
考试   3.0  86.0    6.0  57.0
体育  11.0  19.0   63.0  84.0

In [177]:
frame2

     one   two  three  four
美术  75.0  78.0   51.0  89.0
体育  94.0   3.0   34.0  21.0

In [179]:
frame1.add(frame2,fill_value=0)  #同理

      one   two  three   four
体育  105.0  22.0   97.0  105.0
体重   83.0  77.0   44.0   37.0
年龄   86.0  87.0   25.0   57.0
美术   75.0  78.0   51.0   89.0
考试    3.0  86.0    6.0   57.0

In [183]:
data1.rmul(data2,fill_value=1)

a     100.0
b     400.0
c       3.0
d       4.0
e       5.0
f    1800.0
dtype: float64

### 3.8 DataFrame和Series之间的运算

**首先两个不同列表的运算是具有广播性质的，如果一个表和另一个表的索引是相同的，它的加减是每个都要运算**

**横向**

In [184]:
frame = pd.DataFrame(np.ceil(np.random.uniform(1,100,(4,4))),index=['体重','年龄','考试','体育'],
                   columns=['a','b','c','d'])

In [186]:
frame

       a     b     c     d
体重  55.0  29.0  37.0  12.0
年龄  46.0  28.0  63.0  51.0
考试  76.0  80.0  81.0  74.0
体育  97.0  80.0  87.0  51.0

In [197]:
data = pd.Series(np.arange(4),index=['a','b','c','d'])

In [198]:
data

a    0
b    1
c    2
d    3
dtype: int32

In [199]:
frame+data

       a     b     c     d
体重  55.0  30.0  39.0  15.0
年龄  46.0  29.0  65.0  54.0
考试  76.0  81.0  83.0  77.0
体育  97.0  81.0  89.0  54.0

In [200]:
data.reindex(['a','b','c','f'])

a    0.0
b    1.0
c    2.0
f    NaN
dtype: float64

In [203]:
frame+data.reindex(['a','b','c','f'])

       a     b     c   d   f
体重  55.0  30.0  39.0 NaN NaN
年龄  46.0  29.0  65.0 NaN NaN
考试  76.0  81.0  83.0 NaN NaN
体育  97.0  81.0  89.0 NaN NaN

**纵向**

In [205]:
series = frame['a']+10
series

体重     65.0
年龄     56.0
考试     86.0
体育    107.0
Name: a, dtype: float64

In [207]:
frame+series  #这种情况是，默认为横向

     a   b   c   d  体育  体重  年龄  考试
体重 NaN NaN NaN NaN NaN NaN NaN NaN
年龄 NaN NaN NaN NaN NaN NaN NaN NaN
考试 NaN NaN NaN NaN NaN NaN NaN NaN
体育 NaN NaN NaN NaN NaN NaN NaN NaN

In [210]:
frame.add(series,axis=0)

        a      b      c      d
体重  120.0   94.0  102.0   77.0
年龄  102.0   84.0  119.0  107.0
考试  162.0  166.0  167.0  160.0
体育  204.0  187.0  194.0  158.0

### 3.9 函数的应用和映射

**对于pands的每个元素，我可以通过几种办法运算：1.使用numpy的元素级方法；2.python的函数或匿名函数**

In [213]:
frame = pd.DataFrame(np.ceil(np.random.uniform(-100,100,(4,4))),index=['体重','年龄','考试','体育'],
                   columns=['a','b','c','d'])
frame

       a     b     c     d
体重   5.0 -45.0 -28.0 -78.0
年龄 -47.0 -52.0 -31.0 -78.0
考试 -85.0 -45.0 -39.0 -56.0
体育 -51.0 -71.0  -1.0  -5.0

In [215]:
np.abs(frame) #正数

       a     b     c     d
体重   5.0  45.0  28.0  78.0
年龄  47.0  52.0  31.0  78.0
考试  85.0  45.0  39.0  56.0
体育  51.0  71.0   1.0   5.0

In [216]:
f = lambda x : x.max() - x.min()

In [220]:
'''
对于行列，先管列，后管行
'''
frame.apply(f)

a    90.0
b    26.0
c    38.0
d    73.0
dtype: float64

In [218]:
frame.apply(f,axis=1)

体重    83.0
年龄    47.0
考试    46.0
体育    70.0
dtype: float64

**使用函数**

In [221]:
def f(x):
    return pd.Series([x.min(),x.max()],index=['min','max'])

In [222]:
frame.apply(f)

        a     b     c     d
min -85.0 -71.0 -39.0 -78.0
max   5.0 -45.0  -1.0  -5.0

In [223]:
frame.apply(f,axis=1)

     min   max
体重 -78.0   5.0
年龄 -78.0 -31.0
考试 -85.0 -39.0
体育 -71.0  -1.0

### 3.10 排序和排名

**先说排序，排序就是通过索引和数据来从小或从大的排序**

In [224]:
'''
sort_index()方法可以返回一个新的排序过后的对象
'''

'\nsort_index()方法可以返回一个新的排序过后的对象\n'

In [225]:
obj = pd.Series(range(4),index=['d','a','b','c'])

In [226]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [243]:
frame = pd.DataFrame(np.ceil(np.random.uniform(-100,100,(4,4))),index=['体重','年龄','考试','体育'],
                   columns=['d','a','b','c'])
frame

       d     a     b     c
体重 -62.0  28.0  71.0  79.0
年龄 -76.0 -30.0  99.0 -45.0
考试 -70.0  10.0 -45.0  57.0
体育  94.0 -64.0 -77.0  71.0

In [244]:
"""
不加限定的话，会根据任意轴的索引排序
"""

'\n不加限定的话，会根据任意轴的索引排序\n'

In [245]:
frame.sort_index()   #因为是随机的，我压根就没看出来哪里排序了

       d     a     b     c
体育  94.0 -64.0 -77.0  71.0
体重 -62.0  28.0  71.0  79.0
年龄 -76.0 -30.0  99.0 -45.0
考试 -70.0  10.0 -45.0  57.0

In [246]:
frame.sort_index(axis=1)

       a     b     c     d
体重  28.0  71.0  79.0 -62.0
年龄 -30.0  99.0 -45.0 -76.0
考试  10.0 -45.0  57.0 -70.0
体育 -64.0 -77.0  71.0  94.0

In [247]:
'''
通过ascending=参数排序，决定升序还是降序
'''

'\n通过ascending=参数排序，决定升序还是降序\n'

In [248]:
frame.sort_index(axis=1,ascending=False)

       d     c     b     a
体重 -62.0  79.0  71.0  28.0
年龄 -76.0 -45.0  99.0 -30.0
考试 -70.0  57.0 -45.0  10.0
体育  94.0  71.0 -77.0 -64.0

对于series可以使用values的方法

In [251]:
obj = pd.Series(np.ceil(np.random.uniform(1,100,7)))

In [252]:
obj

0    97.0
1    49.0
2    34.0
3    37.0
4    27.0
5    75.0
6    57.0
dtype: float64

In [254]:
obj.sort_values()

4    27.0
2    34.0
3    37.0
1    49.0
6    57.0
5    75.0
0    97.0
dtype: float64

In [255]:
obj.sort_values(ascending=False)

0    97.0
5    75.0
6    57.0
1    49.0
3    37.0
2    34.0
4    27.0
dtype: float64

In [256]:
'''
如果是nan，那么排序就会自动放到后面
'''

'\n如果是nan，那么排序就会自动放到后面\n'

**对于DataFrame来说，如果想将特定的列排序，那么就用by参数来指定**

In [259]:
frame = pd.DataFrame(np.ceil(np.random.uniform(-100,100,(4,4))),index=['体重','年龄','考试','体育'],
                   columns=['d','a','b','c'])
frame

       d     a     b     c
体重 -51.0  83.0 -47.0  19.0
年龄  88.0  50.0 -49.0 -71.0
考试 -89.0  81.0 -62.0 -12.0
体育  67.0  44.0  -5.0 -36.0

In [260]:
frame.sort_values(by='a')

       d     a     b     c
体育  67.0  44.0  -5.0 -36.0
年龄  88.0  50.0 -49.0 -71.0
考试 -89.0  81.0 -62.0 -12.0
体重 -51.0  83.0 -47.0  19.0

In [262]:
'''
也可以是两个，或多个数据同时影响
'''

'\n也可以是两个，或多个数据同时影响\n'

In [263]:
frame.sort_values(by=['a','c'])

       d     a     b     c
体育  67.0  44.0  -5.0 -36.0
年龄  88.0  50.0 -49.0 -71.0
考试 -89.0  81.0 -62.0 -12.0
体重 -51.0  83.0 -47.0  19.0

**排名使用内置的rank()**

In [264]:
'''
先看几个现象
'''

'\n先看几个现象\n'

In [265]:
obj = pd.Series(np.arange(4))

In [266]:
obj

0    0
1    1
2    2
3    3
dtype: int32

In [267]:
obj.rank()

0    1.0
1    2.0
2    3.0
3    4.0
dtype: float64

In [268]:
obj = pd.Series([4,32,5,7])

In [271]:
obj

0     4
1    32
2     5
3     7
dtype: int64

In [272]:
obj.rank()

0    1.0
1    4.0
2    2.0
3    3.0
dtype: float64

**具体的解释https://blog.csdn.net/code_porter/article/details/86517233**

**说白了rank()目的是，有一个规则来得出数据的排名**

## 4.计算描述统计

### 4.1相关系数与协方差

In [7]:
pip install pandas_datareader

Requirement already satisfied: pandas_datareader in c:\users\lenovo\anaconda3\lib\site-packages (0.7.0)
Requirement already satisfied: requests>=2.3.0 in c:\users\lenovo\anaconda3\lib\site-packages (from pandas_datareader) (2.21.0)
Requirement already satisfied: wrapt in c:\users\lenovo\anaconda3\lib\site-packages (from pandas_datareader) (1.11.1)
Requirement already satisfied: pandas>=0.19.2 in c:\users\lenovo\anaconda3\lib\site-packages (from pandas_datareader) (0.24.2)
Requirement already satisfied: lxml in c:\users\lenovo\anaconda3\lib\site-packages (from pandas_datareader) (4.3.2)
Requirement already satisfied: idna<2.9,>=2.5 in c:\users\lenovo\anaconda3\lib\site-packages (from requests>=2.3.0->pandas_datareader) (2.8)
Requirement already satisfied: certifi>=2017.4.17 in c:\users\lenovo\anaconda3\lib\site-packages (from requests>=2.3.0->pandas_datareader) (2019.3.9)
Requirement already satisfied: urllib3<1.25,>=1.21.1 in c:\users\lenovo\anaconda3\lib\site-packages (from requests>=2.3.0->pandas_datareader) (1.24.1)
Requirement already satisfied: chardet<3.1.0,>=3.0.2 in c:\users\lenovo\anaconda3\lib\site-packages (from requests>=2.3.0->pandas_datareader) (3.0.4)
Requirement already satisfied: python-dateutil>=2.5.0 in c:\users\lenovo\anaconda3\lib\site-packages (from pandas>=0.19.2->pandas_datareader) (2.8.0)
Requirement already satisfied: pytz>=2011k in c:\users\lenovo\anaconda3\lib\site-packages (from pandas>=0.19.2->pandas_datareader) (2018.9)
Requirement already satisfied: numpy>=1.12.0 in c:\users\lenovo\anaconda3\lib\site-packages (from pandas>=0.19.2->pandas_datareader) (1.16.2)
Requirement already satisfied: six>=1.5 in c:\users\lenovo\anaconda3\lib\site-packages (from python-dateutil>=2.5.0->pandas>=0.19.2->pandas_datareader) (1.12.0)
Note: you may need to restart the kernel to use updated packages.

In [11]:
import pandas_datareader.data as web
import pandas as pd

**使用pands_datareader模块下载股票数据**

In [9]:
all_data = {ticker:web.get_data_yahoo(ticker)
            for ticker in ['AAPL','IBM','MSFT','GOOG']}

In [13]:
price = pd.DataFrame({ticker:data['Adj Close'] 
                     for ticker,data in all_data.items()})

In [18]:
volume = pd.DataFrame({ticker:data['Volume']
                     for ticker,data in all_data.items()})

In [19]:
returns = price.pct_change()

In [20]:
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2019-06-20  0.008036  0.012912  0.009286  0.008246
2019-06-21 -0.003409  0.002521  0.000146  0.009411
2019-06-24 -0.001006  0.001078  0.005914 -0.005669
2019-06-25 -0.015158 -0.007104 -0.031572 -0.026149
2019-06-26  0.021629  0.001156  0.003747 -0.006029

**Series中使用corr计算表格里面，重叠的，非nan，按索引对其的相关系数。与此类似，cov用于计算协方差**

In [23]:
returns['MSFT'].corr(returns['IBM'])

0.4870596153423328

In [24]:
returns['MSFT'].cov(returns['IBM'])

8.677218446212491e-05

### 4.2唯一值，计数值和成员资格

**对于一个表格，我们需要在不知道完全的样貌的情况下，我们需要判断元素是否唯一。如果不唯一，我们要统计重复的数有几个**

In [25]:
obj = pd.Series(['A','A','A','A','A','S','S','S','D','F','G'])

In [26]:
obj

0     A
1     A
2     A
3     A
4     A
5     S
6     S
7     S
8     D
9     F
10    G
dtype: object

In [28]:
obj.unique() #得到唯一值的数组

array(['A', 'S', 'D', 'F', 'G'], dtype=object)

In [30]:
obj.value_counts() #计算重复的的个数

A    5
S    3
F    1
D    1
G    1
dtype: int64

In [31]:
obj.value_counts(sort=False)

G    1
D    1
F    1
A    5
S    3
dtype: int64

**isin判断是否是表格里面的值**

In [32]:
obj

0     A
1     A
2     A
3     A
4     A
5     S
6     S
7     S
8     D
9     F
10    G
dtype: object

In [34]:
mask = obj.isin(['A','S'])
mask

0      True
1      True
2      True
3      True
4      True
5      True
6      True
7      True
8     False
9     False
10    False
dtype: bool

In [38]:
obj[mask] #通过Ture和Flase来将里面符合的数提出

0    A
1    A
2    A
3    A
4    A
5    S
6    S
7    S
dtype: object